export const Student = ({ name, age, grade }) => {

    // if (grade > 95) {
    //     return <>
    //         <p>~~~~~~~~~~~~~~~~~~~~</p>
    //         <p>name: {name}</p>
    //         <p>age: {age}</p>
    //         <p>grade: {grade}</p>
    //         <h4>מעולה! עלה והצלח! 👍😊</h4>
    //         <p>~~~~~~~~~~~~~~~~~~~~</p>
    //     </>
    // }
    // else {
    //     return <>
    //         <p>~~~~~~~~~~~~~~~~~~~~</p>
    //         <p>name: {name}</p>
    //         <p>age: {age}</p>
    //         <p>grade: {grade}</p>
    //         <h4>טעון שיפור 😢</h4>
    //         <p>~~~~~~~~~~~~~~~~~~~~</p>
    //     </>
    // }

    return <>
        <p>~~~~~~~~~~~~~~~~~~~~</p>
        <p>name: {name}</p>
        {name && name.length < 2 && <h4>שם קצר מידי</h4>}
        <p>age: {age}</p>
        {/* {age > 10 && age < 20 && <h4>אופס! אתה בגיל הטיפשעשרה...</h4> && <h4>זה הגיל הכי כיףףףף!</h4>} */}
        {/* {age > 10 && age < 20 || <h4>אופס! אתה בגיל הטיפשעשרה...</h4>} */}
        {age > 10 && age < 20 && <><h4>אופס! אתה בגיל הטיפשעשרה...</h4><h4>זה הגיל הכי כיףףףף!</h4></>}
        <p>grade: {grade}</p>
        {/* מקוצר if */}
        {/* תנאי */}
        {/* ? = התנאי התקיים */}
        {/* : = אם לא התקיים */}
        {grade > 95
            ? <h4>מעולה! עלה והצלח! 👍😊</h4>
            : <h4>טעון שיפור 😢</h4>
        }
        <p>~~~~~~~~~~~~~~~~~~~~</p>
    </>

}